// Copyright (c) Microsoft Corporation. All rights reserved.
// Licensed under the MIT license.

#pragma once

#include <atomic>
#include <cassert>
#include <cstdint>
#include <cstring>
#include <mutex>
#include <thread>

#include "device/file_system_disk.h"
#include "address.h"
#include "async_result_types.h"
#include "gc_state.h"
#include "light_epoch.h"
#include "native_buffer_pool.h"
#include "recovery_status.h"
#include "status.h"

namespace FASTER {
namespace core {

/// The log allocator, used by FASTER to store records.

enum class FlushStatus : uint8_t {
  Flushed,
  InProgress
};

enum class CloseStatus : uint8_t {
  Closed,
  Open
};

/// Pack flush- and close-status into a single 16-bit value.
/// State transitions are:
/// { Flushed, Closed } (default state)
/// --> { InProgress, Open } (when issuing the flush to disk)
/// --> either { . , Closed} (when moving the head address forward)
///     or     { Flushed, . } (when the flush completes).
struct FlushCloseStatus {
  FlushCloseStatus()
    : flush{ FlushStatus::Flushed }
    , close{ CloseStatus::Closed } {
  }

  FlushCloseStatus(FlushStatus flush_, CloseStatus close_)
    : flush{ flush_ }
    , close{ close_ } {
  }

  FlushCloseStatus(uint16_t control_)
    : control{ control_ } {
  }

  /// Is the page ready for use?
  inline bool Ready() const {
    return flush == FlushStatus::Flushed && close == CloseStatus::Open;
  }

  union {
      struct {
        FlushStatus flush;
        CloseStatus close;
      };
      uint16_t control;
    };
};
static_assert(sizeof(FlushCloseStatus) == 2, "sizeof(FlushCloseStatus) != 2");

/// Atomic version of FlushCloseStatus. Can set and get flush- and close- status, together,
/// atomically.
class AtomicFlushCloseStatus {
 public:
  AtomicFlushCloseStatus()
    : status_{} {
  }

  inline void store(FlushStatus flush, CloseStatus close) {
    // Sets flush and close statuses, atomically.
    FlushCloseStatus status{ flush, close };
    control_.store(status.control);
  }

  inline FlushCloseStatus load() const {
    // Gets flush and close statuses, atomically.
    return FlushCloseStatus{ control_.load() };
  }

  inline bool compare_exchange_weak(FlushCloseStatus& expected, FlushCloseStatus value) {
    uint16_t expected_control = expected.control;
    bool result = control_.compare_exchange_weak(expected_control, value.control);
    expected.control = expected_control;
    return result;
  }
  inline bool compare_exchange_strong(FlushCloseStatus& expected, FlushCloseStatus value) {
    uint16_t expected_control = expected.control;
    bool result = control_.compare_exchange_strong(expected_control, value.control);
    expected.control = expected_control;
    return result;
  }

  union {
      FlushCloseStatus status_;
      std::atomic<uint16_t> control_;
    };
};
static_assert(sizeof(AtomicFlushCloseStatus) == 2, "sizeof(FlushCloseStatus) != 2");

struct FullPageStatus {
  FullPageStatus()
    : LastFlushedUntilAddress{ 0 }
    , status{} {
  }

  AtomicAddress LastFlushedUntilAddress;
  AtomicFlushCloseStatus status;
};
static_assert(sizeof(FullPageStatus) == 16, "sizeof(FullPageStatus) != 16");

/// Page and offset of the tail of the log. Can reserve space within the current page or move to a
/// new page.
class PageOffset {
 public:
  PageOffset(uint32_t page, uint64_t offset)
    : offset_{ offset }
    , page_{ page } {
    assert(page <= Address::kMaxPage);
  }

  PageOffset(uint64_t control)
    : control_{ control } {
  }

  PageOffset(const Address& address)
    : offset_{ address.offset() }
    , page_{ address.page() } {
  }

  /// Accessors.
  inline uint64_t offset() const {
    return offset_;
  }
  inline uint32_t page() const {
    return static_cast<uint32_t>(page_);
  }
  inline uint64_t control() const {
    return control_;
  }

  /// Conversion operator.
  inline operator Address() const {
    assert(offset_ <= Address::kMaxOffset);
    return Address{ page(), static_cast<uint32_t>(offset()) };
  }

 private:
  /// Use 41 bits for offset, which gives us approximately 2 PB of overflow space, for
  /// Reserve().
  union {
      struct {
        uint64_t offset_ : 64 - Address::kPageBits;
        uint64_t page_ : Address::kPageBits;
      };
      uint64_t control_;
    };
};
static_assert(sizeof(PageOffset) == 8, "sizeof(PageOffset) != 8");

/// Atomic page + offset marker. Can Reserve() space from current page, or move to NewPage().
class AtomicPageOffset {
 public:
  AtomicPageOffset()
    : control_{ 0 } {
  }

  AtomicPageOffset(uint32_t page, uint64_t offset)
    : control_{ PageOffset{ page, offset } .control() } {
  }

  AtomicPageOffset(const Address& address) {
    PageOffset page_offset{ address };
    control_.store(page_offset.control());
  }

  /// Reserve space within the current page. Can overflow the page boundary (so result offset >
  /// Address::kMaxOffset).
  inline PageOffset Reserve(uint32_t num_slots) {
    assert(num_slots <= Address::kMaxOffset);
    PageOffset offset{ 0, num_slots };
    return PageOffset{ control_.fetch_add(offset.control()) };
  }

  /// Move to the next page. The compare-and-swap can fail. Returns "true" if some thread advanced
  /// the thread; sets "won_cas" = "true" if this thread won the CAS, which means it has been
  /// chosen to set up the new page.
  inline bool NewPage(uint32_t old_page, bool& won_cas) {
    assert(old_page < Address::kMaxPage);
    won_cas = false;
    PageOffset expected_page_offset = load();
    if(old_page != expected_page_offset.page()) {
      // Another thread already moved to the new page.
      assert(old_page < expected_page_offset.page());
      return true;
    }
    PageOffset new_page{ old_page + 1, 0 };
    uint64_t expected = expected_page_offset.control();
    // Try to move to a new page.
    won_cas = control_.compare_exchange_strong(expected, new_page.control());
    return PageOffset{ expected } .page() > old_page;
  }

  inline PageOffset load() const {
    return PageOffset{ control_.load() };
  }
  inline void store(Address address) {
    PageOffset page_offset{ address.page(), address.offset() };
    control_.store(page_offset.control());
  }

 private:
  union {
      /// Atomic access to the page+offset.
      std::atomic<uint64_t> control_;
    };
};
static_assert(sizeof(AtomicPageOffset) == 8, "sizeof(AtomicPageOffset) != 8");

/// The main allocator.
template <class D>
class PersistentMemoryMalloc {
 public:
  typedef D disk_t;
  typedef typename D::file_t file_t;
  typedef typename D::log_file_t log_file_t;
  typedef PersistentMemoryMalloc<disk_t> alloc_t;

  /// Each page in the buffer is 2^25 bytes (= 32 MB).
  static constexpr uint64_t kPageSize = Address::kMaxOffset + 1;

  /// The first 4 HLOG pages should be below the head (i.e., being flushed to disk).
  static constexpr uint32_t kNumHeadPages = 4;

  PersistentMemoryMalloc(bool has_no_backing_storage, uint64_t log_size, LightEpoch& epoch, disk_t& disk_, log_file_t& file_,
                         Address start_address, double log_mutable_fraction, bool pre_allocate_log)
    : sector_size{ static_cast<uint32_t>(file_.alignment()) }
    , epoch_{ &epoch }
    , disk{ &disk_ }
    , file{ &file_ }
    , read_buffer_pool{ 1, sector_size }
    , io_buffer_pool{ 1, sector_size }
